const _scheduleConfig = {

    // 倒计时目标：位于右侧框中的倒计时，输入日期即可，可以是中考高考期末等等，格式YYYY-MM-DD
    // 若想隐藏右侧的倒计时，请在下方冒号后填入'hidden', (包括引号)
    countdown_target: 'hidden',

    // 星期显示：左侧框是否显示，显示为true，隐藏为false
    // 直接将true或false填入冒号后边，没有引号
    week_display: true,

    // 科目名称：所有课程科目的简写及其对应全称，冒号前面(key)为简写，后面(value)为全称，不限字数，
    // 若存在多个课程简写相同，需要加以区分，可以为简写添加下角标，使用@分隔，如'自@语'，@前为简写，@后为下角标
    // 要求必须做到覆盖完全，否则可能会保错
    subject_name: {
        '自@语': '语文自习',
        '自@数': '数学自习',
        '自@英': '英语自习',
        '自@物': '物理自习',
        '自@化': '化学自习',
        '自@政': '政治自习',
        '自@历': '历史自习',
        '自@心': '心理自习',
        '自@美': '美术自习',
        '自@音': '音乐自习',
        '自@地': '地理自习',
        '物': '物理',
        '心': '心理',
        '英': '英语',
        '化': '化学',
        '语': '语文',
        '体': '体育',
        '数': '数学',
        '生': '生物',
        '地': '地理',
        '历': '历史',
        '政': '政治',
        '班': '班会',
        '音': '音乐',
        '信': '信息技术',
        '通': '通用技术',
        '空': '占位符',
        '会': '集会',
        '美': '美术',
    },

    // 时间表: 每天课程安排的时间表，内层冒号前面为时间，后面为课程序号(从0开始的数字[不带'']) 或 课间具体名称(用''包裹中间写文字)
    // 注：时间段中-后的时间要减一分钟 比如某节课40分钟，时间段为08:00-08:40，但实际配置时要配置'08:00-08:39'
    timetable: {
        xq5: {
            '00:00-07:39': '早读',
            '08:00-08:39': 0,
            '08:40-08:49': '课间',
            '08:50-09:29': 1,
            '09:30-09:39': '课间',
            '09:40-10:19': 2,
            '10:20-10:29': '眼操+课间',
            '10:30-11:09': 3,
            '11:10-11:19': '课间',
            '11:20-12:09': 4,
            '12:11-13:29': '午休',
            '13:30-14:09': 5,
            '14:10-14:19': '课间',
            '14:20-14:59': 6,
        },
        xq1: {
            '00:00-07:59': '升旗',
            '08:00-08:39': 0,
            '08:40-08:49': '课间',
            '08:50-09:29': 1,
            '09:30-09:39': '课间',
            '09:40-10:19': 2,
            '10:20-10:29': '眼操+课间',
            '10:30-11:09': 3,
            '11:10-11:19': '课间',
            '11:20-12:09': 4,
            '12:10-14:09': '午休',
            '14:10-14:49': 5,
            '14:50-14:59': '课间',
            '15:00-15:39': 6,
            '15:40-15:54': '眼操+课间',
            '15:55-16:34': 7,
            '16:35-16:44': '课间',
            '16:45-17:24': 8,
            '17:26-18:39': '自由活动',
            '18:40-19:29': 9,
            '19:30-19:39': '课间',
            '19:40-20:29': 10,
            '20:30-20:39': '课间',
            '20:40-21:29': 11,
            '21:30-23:59': '放学',
        },
        workday: {
            '00:00-07:39': '早读',
            '08:00-08:39': 0,
            '08:40-08:49': '课间',
            '08:50-09:29': 1,
            '09:30-09:39': '课间',
            '09:40-10:19': 2,
            '10:20-10:29': '眼操+课间',
            '10:30-11:09': 3,
            '11:10-11:19': '课间',
            '11:20-12:09': 4,
            '12:10-14:09': '午休',
            '14:10-14:49': 5,
            '14:50-14:59': '课间',
            '15:00-15:39': 6,
            '15:40-15:54': '眼操+课间',
            '15:55-16:34': 7,
            '16:35-16:44': '课间',
            '16:45-17:24': 8,
            '17:26-18:39': '自由活动',
            '18:40-19:29': 9,
            '19:30-19:39': '课间',
            '19:40-20:29': 10,
            '20:30-20:39': '课间',
            '20:40-21:29': 11,
            '21:30-23:59': '放学',
        },
        weekend: {
            '00:00-18:29': '自由活动',
            '18:39-19:29': 0,
            '19:30-19:39': '课间',
            '19:40-20:29': 1,
            '20:30-20:39': '课间',
            '20:40-21:29': 2,
            '21:30-23:59': '放学',
        }
    },

    // 分隔线: 课表中区分不同时段课程的分隔线配置，外层key（冒号前）部分与上面timeable相同
    // value（冒号后）为分隔线所在位置的前一个课程序号(从0开始的数字[不带''])
    divider: {
        xq1: [4, 8],
        xq5: [4],
        workday: [4, 8],
        weekend: [0,1]
    },

    // 从classList后最外的中括号看起，里面的第几个元素的序号-1就是该元素的下标，这个下标对应你在上面timetable中配置的数字，课程用单引号包含，写入在subject_name中配置的简写
    // 如果该节课可能存在每周轮换，你可以用一个中括号把他们全部写进去如: ['(第一周课)物', '(第二周)化', '(第三周)地', '(第四周)数'](小括号及其内容无需填写, 最多支持四周轮换)
    // 下面的timetable中配置该日属于在上面的timetable中的哪一类，如周日属于weekend就这样写 timetable: 'weekend'，用单引号包含
    daily_class: [
        {
            Chinese: '日',
            English: 'SUN',
            classList: ['班', '自@数', '自@化'],
            timetable: 'weekend'
        },
        {
            Chinese: '一',
            English: 'MON',
            classList: ['数', '数', '地', '物', '英', '体', '语', '历', '化', '自@音', '自@语', '自@物'],
            timetable: 'xq1'
        },
        {
            Chinese: '二',
            English: 'TUE',
            classList: ['语', '英', '英', '数', '数', '物', '历', '生', '会', '自@美', '自@语', '自@地'],
            timetable: 'workday'
        },
        {
            Chinese: '三',
            English: 'WED',
            classList: ['英', '历', '语', '数', '化', '政', '语', '物', '体', '自@政', '自@英', '自@英'],
            timetable: 'workday'
        },
        {
            Chinese: '四',
            English: 'THR',
            classList: ['数', '生', '语', '自@历',['美', '音'], '体', '英','地','社','自@数', '自@化', '自@历'],
            timetable: 'workday'
        },
        {
            Chinese: '五',
            English: 'FRI',
            classList: ['语', '英', '政', '心', '数','自@物', ['通', '心']],
            timetable: 'xq5'
        },
        {
            Chinese: '六',
            English: 'SAT',
            classList: ['Bingo!', 'Bingo!', 'Bingo!'],
            timetable: 'weekend'
        }
    ],


    // 课表样式: 配置课表样式CSS变量, 包括字体大小，透明度等属性
    // 请不要更改冒号前半部分文字, 请更改冒号后单引号中的数字(切勿删除引号与数字后的单位), 如果你对CSS有所了解你也可以尝试更改CSS单位
    css_style: {
        '--center-font-size': '45px', // 中间课表中的课程简写单字的字体大小
        '--corner-font-size': '0px', // 左侧的星期中文角标与右侧的"天"字的字体大小
        '--countdown-font-size': '30px', // 课程或课间全称与倒计时的字体大小
        '--global-border-radius': '25px', // 所有背景框的圆角大小
        '--global-bg-opacity': '0.6', // 所有背景框的不透明度, 范围: [0, 1]
        '--container-bg-padding': '8px 14px', // 上面三个框各自的背景内边距, 前面的数字表示纵向边距，后面的数字表示横向边距
        '--countdown-bg-padding': '8px 12px', // 倒计时框的背景内边距, 前面的数字表示纵向边距，后面的数字表示横向边距
        '--container-space': '12px', // 上面三个框中间的间隔长度
        '--top-space': '12px', // 课表主体最顶端与电脑屏幕上边框的间隔长度
        '--main-horizontal-space': '6px', // 中间课表中的课程简写单字之间的间隔长度
        '--divider-width': '2px', // 分隔线宽度
        '--divider-margin': '4px', // 分隔线外边距
        '--triangle-size': '10px', // 倒计时框上方小三角箭头的大小
        '--sub-font-size': '15px', // 中间课表中的课程下角标(X@X)的字体大小
    },
    
}

var scheduleConfig = JSON.parse(JSON.stringify(_scheduleConfig))
